# ConvertToPolyline

## Description
Converts any enclosed shape (circle, rectangle, ellipse, etc.) into a polygon or polyline. Does not polygonalize.

```pascal
FUNCTION ConvertToPolyline(h : HANDLE) : HANDLE;
```

```python

def vs.ConvertToPolyline(h):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||

## Version
Availability: from Vectorworks 2014
## Category
* Graphic Calculation